# IFC_SetIFCScheme

## Description
Sets the active IFC version

```pascal
FUNCTION IFC_SetIFCScheme(scheme : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_SetIFCScheme(scheme):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|scheme|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* IFC